# Используем официальный Python 3.11 образ на базе slim
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей в контейнер
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем всё содержимое проекта в контейнер
COPY . .

# Открываем порт, на котором будет работать приложение
EXPOSE 8000

# Команда запуска приложения с Gunicorn (4 рабочих процесса)
CMD ["gunicorn", "-w", "4", "-b", "0.0.0.0:8000", "app:app"]
